docs/20211202104125-battery_soh_prediction_using_generative_model.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Battery SOH prediction using Generative Model</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Battery SOH prediction using Generative Model</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b50e30">input</a>
<ul>
<li><a href="#orgec31e33">voltage</a></li>
<li><a href="#org73f7577">current</a></li>
<li><a href="#org0457601">&#x2026;etc</a></li>
</ul>
</li>
<li><a href="#org0e9434f">output</a>
<ul>
<li><a href="#orgda8cc08">SOH prediction: SOC</a></li>
</ul>
</li>
<li><a href="#org69e711f">Use Cases:</a>
<ul>
<li><a href="#org0e8946e">charging</a>
<ul>
<li><a href="#orge4295e8">Fast charging</a></li>
<li><a href="#orgafa0c02">AC/DC charging</a></li>
</ul>
</li>
<li><a href="#org44a3ebb">driving</a></li>
</ul>
</li>
<li><a href="#org6b5c315">Motivation</a>
<ul>
<li><a href="#orgcacb79a">No labels, no models</a></li>
<li><a href="#org4bbb7a3">need outlier detection</a></li>
<li><a href="#org8a00398">unsupervised learning</a>
<ul>
<li><a href="#orgf994325">given a data X (one time sequence of voltage), under a specific usage (fast charging)</a></li>
<li><a href="#orgc980a59">determine whether it's normal or abnormal</a></li>
<li><a href="#org59a5e3a">Most of the battery cells are OK, say 90%, to get the most of the training data (safe assumption)</a></li>
<li><a href="#org751a251">check the remaining 10% to pick out the outliers</a></li>
</ul>
</li>
<li><a href="#org3cf1ce8">Learn the data distribution in a high dimenional feature space X</a></li>
<li><a href="#org728372c">Learn the feature unsupervised (latent variable Z)</a></li>
<li><a href="#orgb1baf50">get the latent variable Z</a></li>
<li><a href="#org68a5ac8">Conditioned on input data current value</a></li>
<li><a href="#org50317a6">Specification of typical use cases: fast charge, driving</a></li>
<li><a href="#org1bc711d">Generate diverse time series under the</a></li>
</ul>
</li>
<li><a href="#orgd1f59ec">Issue</a>
<ul>
<li><a href="#orgbfe1371">Limited samples for training</a>
<ul>
<li><a href="#org797b46f">adaptive discriminator oaugmentation</a></li>
<li><a href="#orgfd55219">data augmentation</a></li>
</ul>
</li>
<li><a href="#org1aeb731">discriminator overfitting early</a></li>
<li><a href="#orgd49bf4f">non-convergence</a>
<ul>
<li><a href="#org92ae9fd">VAE (VQ-VAE)</a></li>
<li><a href="#orge47655f">DDPM</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf984163">Retrospection</a>
<ul>
<li><a href="#org0d47903">TimeGAN</a>
<ul>
<li><a href="#org860caa7">autoencoding (embedding space, efficiency): compression, dynamics encoding (provided by embedder &amp; recovery)</a></li>
<li><a href="#orga2d944f">apply supervised learning (objective time-frequency characteristics, fidelity) to guide adversarial learning (GAN objective): loss addition!</a></li>
<li><a href="#org3d82f17">synchronization (of latent space for real and synthetic, e&amp;f): superviser</a></li>
<li><a href="#org877e866">e, r: MLP+RNN, unidirectional (has to be causal),</a></li>
<li><a href="#org6e8a08c">g: MLP+RNN (noise: Gaussian + Wiener)</a></li>
<li><a href="#org935c04b">d :</a></li>
<li><a href="#org493d72d">not completely integral as pure VAE or GAN, bastlerei</a></li>
<li><a href="#orgd079d3e">equal weights for the additive loss of static feature and time series feature!</a></li>
<li><a href="#org8e0a9e2">the claim that GAN loss alone is not sufficient is very dubious, image data has the same spatial fluctuation but is sufficient!</a></li>
<li><a href="#orgaa0aa26">classification error 10~20% (~48% significantly better), prediction error MAE (normalized, 3.8&amp;~30%) events (~30%)</a></li>
</ul>
</li>
<li><a href="#org68a1fd1">no labels (expert knowledge) for supervised learning</a></li>
<li><a href="#orgdd22dba">challenge and caveats for unsuperviesd learning:</a>
<ul>
<li><a href="#org4fb3c21">relevant features to reflect intrinsic parameters of battery health</a></li>
<li><a href="#org5eb8e32">when the features are relevant, sufficient <b>finite</b> data to represent this distribution</a></li>
<li><a href="#orgf1e3d39">optimal architecture for G and D (optimize weights) :</a></li>
<li><a href="#org6b712c1">no guarantee for convergence</a></li>
<li><a href="#org2b37e92">CGAN and feature labels?</a></li>
</ul>
</li>
<li><a href="#orgd6efffc">Future work</a>
<ul>
<li><a href="#org8d1a669">multimodalities in TimeGAN</a></li>
<li><a href="#orgaae68f9">transformer instead of GRU</a></li>
<li><a href="#orgf8ae94d">diffusion model</a></li>
<li><a href="#orgbe93b6d">extreme event detection</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org62ad2fa">summary</a>
<ul>
<li><a href="#org9c568ec">what has been achieved</a>
<ul>
<li><a href="#org6c24bf6">time series gan with lstm/gru</a></li>
<li><a href="#orge2c0446">time series features</a></li>
<li><a href="#org2cb48dc">rough complexity estimation</a></li>
</ul>
</li>
<li><a href="#org5679137">method</a>
<ul>
<li><a href="#orga12a589">fast feedback with small distriubtion</a></li>
<li><a href="#orgf94885e">target real time series of charging voltage</a></li>
</ul>
</li>
<li><a href="#org508a4c6">model as a platform</a></li>
<li><a href="#orgf795d19">diffusion model</a>
<ul>
<li><a href="#org51ff941">manipulate data distribution</a></li>
<li><a href="#org1090802">static pattern (maximum likelihood estimation) &#x2013;&gt; stochastic differential equation</a></li>
<li><a href="#orgdf3c180">grasp the data distribution finally</a></li>
</ul>
</li>
<li><a href="#org97cd9f1">emperical vs data science</a>
<ul>
<li><a href="#org3f12c22">expert knowledge &#x2013;&gt; absorbed by machine learning model</a></li>
<li><a href="#org19c9c53">deep learnig technology is the best technology so far</a></li>
</ul>
</li>
<li><a href="#org47e722d">difficulty</a>
<ul>
<li><a href="#orgda85816">model complexity of time series</a></li>
<li><a href="#org100e5ba">time series features</a></li>
<li><a href="#orgd92ef6d">machine learning</a></li>
<li><a href="#orgb5f92f0">data volume lacks</a></li>
<li><a href="#orgbbca99d">compute resources lack</a></li>
</ul>
</li>
<li><a href="#org09d0ce4">Chances</a>
<ul>
<li><a href="#org84d1ad7">transformer</a></li>
<li><a href="#org2ae0198">diffusion model</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1b50e30" class="outline-2">
<h2 id="org1b50e30">input</h2>
<div class="outline-text-2" id="text-org1b50e30">
</div>
<div id="outline-container-orgec31e33" class="outline-3">
<h3 id="orgec31e33">voltage</h3>
</div>
<div id="outline-container-org73f7577" class="outline-3">
<h3 id="org73f7577">current</h3>
</div>
<div id="outline-container-org0457601" class="outline-3">
<h3 id="org0457601">&#x2026;etc</h3>
</div>
</div>
<div id="outline-container-org0e9434f" class="outline-2">
<h2 id="org0e9434f">output</h2>
<div class="outline-text-2" id="text-org0e9434f">
</div>
<div id="outline-container-orgda8cc08" class="outline-3">
<h3 id="orgda8cc08">SOH prediction: SOC</h3>
</div>
</div>
<div id="outline-container-org69e711f" class="outline-2">
<h2 id="org69e711f">Use Cases:</h2>
<div class="outline-text-2" id="text-org69e711f">
</div>
<div id="outline-container-org0e8946e" class="outline-3">
<h3 id="org0e8946e">charging</h3>
<div class="outline-text-3" id="text-org0e8946e">
</div>
<div id="outline-container-orge4295e8" class="outline-4">
<h4 id="orge4295e8">Fast charging</h4>
</div>
<div id="outline-container-orgafa0c02" class="outline-4">
<h4 id="orgafa0c02">AC/DC charging</h4>
</div>
</div>
<div id="outline-container-org44a3ebb" class="outline-3">
<h3 id="org44a3ebb">driving</h3>
</div>
</div>
<div id="outline-container-org6b5c315" class="outline-2">
<h2 id="org6b5c315">Motivation</h2>
<div class="outline-text-2" id="text-org6b5c315">
</div>
<div id="outline-container-orgcacb79a" class="outline-3">
<h3 id="orgcacb79a">No labels, no models</h3>
</div>
<div id="outline-container-org4bbb7a3" class="outline-3">
<h3 id="org4bbb7a3">need outlier detection</h3>
</div>
<div id="outline-container-org8a00398" class="outline-3">
<h3 id="org8a00398">unsupervised learning</h3>
<div class="outline-text-3" id="text-org8a00398">
</div>
<div id="outline-container-orgf994325" class="outline-4">
<h4 id="orgf994325">given a data X (one time sequence of voltage), under a specific usage (fast charging)</h4>
</div>
<div id="outline-container-orgc980a59" class="outline-4">
<h4 id="orgc980a59">determine whether it's normal or abnormal</h4>
</div>
<div id="outline-container-org59a5e3a" class="outline-4">
<h4 id="org59a5e3a">Most of the battery cells are OK, say 90%, to get the most of the training data (safe assumption)</h4>
</div>
<div id="outline-container-org751a251" class="outline-4">
<h4 id="org751a251">check the remaining 10% to pick out the outliers</h4>
</div>
</div>
<div id="outline-container-org3cf1ce8" class="outline-3">
<h3 id="org3cf1ce8">Learn the data distribution in a high dimenional feature space X</h3>
</div>
<div id="outline-container-org728372c" class="outline-3">
<h3 id="org728372c">Learn the feature unsupervised (latent variable Z)</h3>
</div>
<div id="outline-container-orgb1baf50" class="outline-3">
<h3 id="orgb1baf50">get the latent variable Z</h3>
</div>
<div id="outline-container-org68a5ac8" class="outline-3">
<h3 id="org68a5ac8">Conditioned on input data current value</h3>
</div>
<div id="outline-container-org50317a6" class="outline-3">
<h3 id="org50317a6">Specification of typical use cases: fast charge, driving</h3>
</div>
<div id="outline-container-org1bc711d" class="outline-3">
<h3 id="org1bc711d">Generate diverse time series under the</h3>
</div>
</div>
<div id="outline-container-orgd1f59ec" class="outline-2">
<h2 id="orgd1f59ec">Issue</h2>
<div class="outline-text-2" id="text-orgd1f59ec">
</div>
<div id="outline-container-orgbfe1371" class="outline-3">
<h3 id="orgbfe1371">Limited samples for training</h3>
<div class="outline-text-3" id="text-orgbfe1371">
</div>
<div id="outline-container-org797b46f" class="outline-4">
<h4 id="org797b46f">adaptive discriminator oaugmentation</h4>
</div>
<div id="outline-container-orgfd55219" class="outline-4">
<h4 id="orgfd55219">data augmentation</h4>
</div>
</div>
<div id="outline-container-org1aeb731" class="outline-3">
<h3 id="org1aeb731">discriminator overfitting early</h3>
</div>
<div id="outline-container-orgd49bf4f" class="outline-3">
<h3 id="orgd49bf4f">non-convergence</h3>
<div class="outline-text-3" id="text-orgd49bf4f">
</div>
<div id="outline-container-org92ae9fd" class="outline-4">
<h4 id="org92ae9fd">VAE (VQ-VAE)</h4>
</div>
<div id="outline-container-orge47655f" class="outline-4">
<h4 id="orge47655f">DDPM</h4>
</div>
</div>
</div>
<div id="outline-container-orgf984163" class="outline-2">
<h2 id="orgf984163">Retrospection</h2>
<div class="outline-text-2" id="text-orgf984163">
</div>
<div id="outline-container-org0d47903" class="outline-3">
<h3 id="org0d47903">TimeGAN</h3>
<div class="outline-text-3" id="text-org0d47903">
</div>
<div id="outline-container-org860caa7" class="outline-4">
<h4 id="org860caa7">autoencoding (embedding space, efficiency): compression, dynamics encoding (provided by embedder &amp; recovery)</h4>
</div>
<div id="outline-container-orga2d944f" class="outline-4">
<h4 id="orga2d944f">apply supervised learning (objective time-frequency characteristics, fidelity) to guide adversarial learning (GAN objective): loss addition!</h4>
</div>
<div id="outline-container-org3d82f17" class="outline-4">
<h4 id="org3d82f17">synchronization (of latent space for real and synthetic, e&amp;f): superviser</h4>
<div class="outline-text-4" id="text-org3d82f17">
</div>
<ul class="org-ul">
<li><a id="org729ad75"></a>let generator learn the dynamics of the actual data distribution in latent space<br /></li>
</ul>
</div>
<div id="outline-container-org877e866" class="outline-4">
<h4 id="org877e866">e, r: MLP+RNN, unidirectional (has to be causal),</h4>
<div class="outline-text-4" id="text-org877e866">
</div>
<ul class="org-ul">
<li><a id="org2ad4af0"></a>deterministic Encoder-Decoder， add probabilistic spin!<br /></li>
<li><a id="org01e3786"></a>r might not be necessary!<br /></li>
</ul>
</div>
<div id="outline-container-org6e8a08c" class="outline-4">
<h4 id="org6e8a08c">g: MLP+RNN (noise: Gaussian + Wiener)</h4>
<div class="outline-text-4" id="text-org6e8a08c">
</div>
<ul class="org-ul">
<li><a id="org81e7be7"></a>\(\mathcal{Z}_{\mathcal{S}}\) and \(\mathcal{Z}_t\) is the real latent of the latent, not the same space as \(\mathcal{S}\) and \(\mathcal{X}_t\)<br /></li>
</ul>
</div>
<div id="outline-container-org935c04b" class="outline-4">
<h4 id="org935c04b">d :</h4>
<div class="outline-text-4" id="text-org935c04b">
</div>
<ul class="org-ul">
<li><a id="org8540b5a"></a>bidirectional(?): as discriminator doesn't have to be causal, retrospective, add capacity) RNN + MLP,<br /></li>
<li><a id="orgeb7927c"></a>\(\tilde{y}_{\mathcal{S}}\) (boolean for static features), \(\tilde{y}_{1:T}\) a boolean on every timestamp (necessary?): true/false has dynamics, timing capacity, then summarization<br /></li>
</ul>
</div>
<div id="outline-container-org493d72d" class="outline-4">
<h4 id="org493d72d">not completely integral as pure VAE or GAN, bastlerei</h4>
</div>
<div id="outline-container-orgd079d3e" class="outline-4">
<h4 id="orgd079d3e">equal weights for the additive loss of static feature and time series feature!</h4>
</div>
<div id="outline-container-org8e0a9e2" class="outline-4">
<h4 id="org8e0a9e2">the claim that GAN loss alone is not sufficient is very dubious, image data has the same spatial fluctuation but is sufficient!</h4>
</div>
<div id="outline-container-orgaa0aa26" class="outline-4">
<h4 id="orgaa0aa26">classification error 10~20% (~48% significantly better), prediction error MAE (normalized, 3.8&amp;~30%) events (~30%)</h4>
</div>
</div>
<div id="outline-container-org68a1fd1" class="outline-3">
<h3 id="org68a1fd1">no labels (expert knowledge) for supervised learning</h3>
</div>
<div id="outline-container-orgdd22dba" class="outline-3">
<h3 id="orgdd22dba">challenge and caveats for unsuperviesd learning:</h3>
<div class="outline-text-3" id="text-orgdd22dba">
</div>
<div id="outline-container-org4fb3c21" class="outline-4">
<h4 id="org4fb3c21">relevant features to reflect intrinsic parameters of battery health</h4>
<div class="outline-text-4" id="text-org4fb3c21">
</div>
<ul class="org-ul">
<li><a id="orgde024d8"></a>the distribution of battery health state depending on those parameters<br /></li>
</ul>
</div>
<div id="outline-container-org5eb8e32" class="outline-4">
<h4 id="org5eb8e32">when the features are relevant, sufficient <b>finite</b> data to represent this distribution</h4>
<div class="outline-text-4" id="text-org5eb8e32">
</div>
<ul class="org-ul">
<li><a id="orgf0aedd3"></a>Example: Gaussian/uniform; GT distribution is the unknown (nonlinear, multimodal, non-stationary) natural density of data: distribution \(p_{\xi}\) &#x2013;&gt; Neural Network v\(p_{\theta}\)<br />
<ul class="org-ul">
<li><a id="org74d56e6"></a>NN very versatile: \(p_{\theta}\) can approxmate any distribution!<br /></li>
<li><a id="org92b2185"></a>prior \(p(z)\) has an impact on the final sample and capability of the whole network: \(p(z) \odot p_{\theta}(x)\)<br /></li>
<li><a id="orgbf9ea08"></a>if enough expert knowledge is available tell us it's normal distribution, just 2 parameters to estimate, still a lot of samples for bootstrapping/bagging, sample mean / sample variance, need confidence level, statistical trial for inspection.<br /></li>
</ul>
</li>
<li><a id="orgcba8548"></a>scenario data (time sequences of specific scenes)<br /></li>
<li><a id="org5d68803"></a>given the current compute resources: the way to go is to reduce the data amount requirement by defining relevant features and relevant scenarios<br /></li>
</ul>
</div>
<div id="outline-container-orgf1e3d39" class="outline-4">
<h4 id="orgf1e3d39">optimal architecture for G and D (optimize weights) :</h4>
<div class="outline-text-4" id="text-orgf1e3d39">
</div>
<ul class="org-ul">
<li><a id="orgdf2ff75"></a>multidimensional continuous function enough? More expertise to make this happen!<br />
<ul class="org-ul">
<li><a id="org82a864a"></a>transformer for sequential modeling<br /></li>
<li><a id="org1f3ab73"></a>make prior learnable<br /></li>
</ul>
</li>
<li><a id="orgb30b59e"></a>optimal hyperparameters?<br /></li>
</ul>
</div>
<div id="outline-container-org6b712c1" class="outline-4">
<h4 id="org6b712c1">no guarantee for convergence</h4>
</div>
<div id="outline-container-org2b37e92" class="outline-4">
<h4 id="org2b37e92">CGAN and feature labels?</h4>
</div>
</div>
<div id="outline-container-orgd6efffc" class="outline-3">
<h3 id="orgd6efffc">Future work</h3>
<div class="outline-text-3" id="text-orgd6efffc">
</div>
<div id="outline-container-org8d1a669" class="outline-4">
<h4 id="org8d1a669">multimodalities in TimeGAN</h4>
<div class="outline-text-4" id="text-org8d1a669">
</div>
<ul class="org-ul">
<li><a id="org56fe5a3"></a>Gaussian mixture model in latent space<br /></li>
</ul>
</div>
<div id="outline-container-orgaae68f9" class="outline-4">
<h4 id="orgaae68f9">transformer instead of GRU</h4>
</div>
<div id="outline-container-orgf8ae94d" class="outline-4">
<h4 id="orgf8ae94d">diffusion model</h4>
</div>
<div id="outline-container-orgbe93b6d" class="outline-4">
<h4 id="orgbe93b6d">extreme event detection</h4>
</div>
</div>
</div>
<div id="outline-container-org62ad2fa" class="outline-2">
<h2 id="org62ad2fa">summary</h2>
<div class="outline-text-2" id="text-org62ad2fa">
</div>
<div id="outline-container-org9c568ec" class="outline-3">
<h3 id="org9c568ec">what has been achieved</h3>
<div class="outline-text-3" id="text-org9c568ec">
</div>
<div id="outline-container-org6c24bf6" class="outline-4">
<h4 id="org6c24bf6">time series gan with lstm/gru</h4>
</div>
<div id="outline-container-orge2c0446" class="outline-4">
<h4 id="orge2c0446">time series features</h4>
</div>
<div id="outline-container-org2cb48dc" class="outline-4">
<h4 id="org2cb48dc">rough complexity estimation</h4>
</div>
</div>
<div id="outline-container-org5679137" class="outline-3">
<h3 id="org5679137">method</h3>
<div class="outline-text-3" id="text-org5679137">
</div>
<div id="outline-container-orga12a589" class="outline-4">
<h4 id="orga12a589">fast feedback with small distriubtion</h4>
</div>
<div id="outline-container-orgf94885e" class="outline-4">
<h4 id="orgf94885e">target real time series of charging voltage</h4>
</div>
</div>
<div id="outline-container-org508a4c6" class="outline-3">
<h3 id="org508a4c6">model as a platform</h3>
</div>
<div id="outline-container-orgf795d19" class="outline-3">
<h3 id="orgf795d19">diffusion model</h3>
<div class="outline-text-3" id="text-orgf795d19">
</div>
<div id="outline-container-org51ff941" class="outline-4">
<h4 id="org51ff941">manipulate data distribution</h4>
</div>
<div id="outline-container-org1090802" class="outline-4">
<h4 id="org1090802">static pattern (maximum likelihood estimation) &#x2013;&gt; stochastic differential equation</h4>
</div>
<div id="outline-container-orgdf3c180" class="outline-4">
<h4 id="orgdf3c180">grasp the data distribution finally</h4>
</div>
</div>
<div id="outline-container-org97cd9f1" class="outline-3">
<h3 id="org97cd9f1">emperical vs data science</h3>
<div class="outline-text-3" id="text-org97cd9f1">
</div>
<div id="outline-container-org3f12c22" class="outline-4">
<h4 id="org3f12c22">expert knowledge &#x2013;&gt; absorbed by machine learning model</h4>
</div>
<div id="outline-container-org19c9c53" class="outline-4">
<h4 id="org19c9c53">deep learnig technology is the best technology so far</h4>
</div>
</div>
<div id="outline-container-org47e722d" class="outline-3">
<h3 id="org47e722d">difficulty</h3>
<div class="outline-text-3" id="text-org47e722d">
</div>
<div id="outline-container-orgda85816" class="outline-4">
<h4 id="orgda85816">model complexity of time series</h4>
<div class="outline-text-4" id="text-orgda85816">
</div>
<ul class="org-ul">
<li><a id="org5025dd9"></a>features need expertise<br /></li>
<li><a id="orgfc5ac3f"></a>conditional models add more complexity<br /></li>
</ul>
</div>
<div id="outline-container-org100e5ba" class="outline-4">
<h4 id="org100e5ba">time series features</h4>
<div class="outline-text-4" id="text-org100e5ba">
</div>
<ul class="org-ul">
<li><a id="org6195588"></a>cannot utilize human intelligence, language, concepts<br /></li>
<li><a id="org2477359"></a>need battery experts opinion<br /></li>
</ul>
</div>
<div id="outline-container-orgd92ef6d" class="outline-4">
<h4 id="orgd92ef6d">machine learning</h4>
<div class="outline-text-4" id="text-orgd92ef6d">
</div>
<ul class="org-ul">
<li><a id="orgc5f096c"></a>GAN unstable<br /></li>
<li><a id="org9298bf1"></a>RNN not for long sequences<br /></li>
</ul>
</div>
<div id="outline-container-orgb5f92f0" class="outline-4">
<h4 id="orgb5f92f0">data volume lacks</h4>
</div>
<div id="outline-container-orgbbca99d" class="outline-4">
<h4 id="orgbbca99d">compute resources lack</h4>
</div>
</div>
<div id="outline-container-org09d0ce4" class="outline-3">
<h3 id="org09d0ce4">Chances</h3>
<div class="outline-text-3" id="text-org09d0ce4">
</div>
<div id="outline-container-org84d1ad7" class="outline-4">
<h4 id="org84d1ad7">transformer</h4>
</div>
<div id="outline-container-org2ae0198" class="outline-4">
<h4 id="org2ae0198">diffusion model</h4>
<div class="outline-text-4" id="text-org2ae0198">
</div>
<ul class="org-ul">
<li><a id="org0ac5adf"></a>acceleration 1000x<br /></li>
<li><a id="orgefe1566"></a>way of recover distribution from big data<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.7)</p>
</div>
</body>
</html>